-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 20 2023 г., 14:13
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cities`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cities`
--

CREATE TABLE `cities` (
  `id` int UNSIGNED NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci NOT NULL,
  `population` int UNSIGNED DEFAULT NULL,
  `region` varchar(5) CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_unicode_ci;

--
-- Дамп данных таблицы `cities`
--

INSERT INTO `cities` (`name`, `population`, `(population / 40000.0) * 100`) VALUES
('Київ', 2888470, '7221.1750'),
('Харків', 1444540, '3611.3500'),
('Одеса', 1010000, '2525.0000'),
('Дніпро', 984423, '2461.0575'),
('Донецьк', 932562, '2331.4050'),
('Запоріжжя', 758011, '1895.0275'),
('Львів', 728545, '1821.3625'),
('Кривий Ріг', 646748, '1616.8700'),
('Миколаїв', 494381, '1235.9525'),
('Маріуполь', 458533, '1146.3325'),
('Луганськ', 417990, '1044.9750'),
('Севастополь', 412630, '1031.5750'),
('Вінниця', 372432, '931.0800'),
('Макіївка', 348173, '870.4325'),
('Сімферополь', 332608, '831.5200'),
('Херсон', 296161, '740.4025'),
('Полтава', 294695, '736.7375'),
('Чернігів', 294522, '736.3050'),
('Черкаси', 284459, '711.1475'),
('Суми', 268409, '671.0225'),
('Житомир', 268000, '670.0000'),
('Хмельницький', 267891, '669.7275'),
('Чернівці', 264427, '661.0675'),
('Горлівка', 250991, '627.4775'),
('Рівне', 249477, '623.6925'),
('Кам\'янське', 240477, '601.1925'),
('Кропивницький', 232052, '580.1300'),
('Івано-Франківськ', 229447, '573.6175'),
('Кременчук', 224997, '562.4925'),
('Тернопіль', 217950, '544.8750'),
('Луцьк', 217082, '542.7050'),
('Біла Церква', 211080, '527.7000'),
('Краматорськ', 160895, '402.2375'),
('Мелітополь', 156719, '391.7975'),
('Керч', 147668, '369.1700'),
('Сєвєродонецьк', 130000, '325.0000'),
('Хрустальний', 124000, '310.0000'),
('Нікополь', 119627, '299.0675'),
('Бердянськ', 115476, '288.6900'),
('Слов\'янськ', 115421, '288.5525'),
('Ужгород', 115195, '287.9875'),
('Алчевськ', 111360, '278.4000'),
('Павлоград', 110144, '275.3600'),
('Євпаторія', 106115, '265.2875'),
('Лисичанськ', 103459, '258.6475'),
('Кам\'янець-Подільський', 101590, '253.9750'),
('Бровари', 100374, '250.9350'),
('Дрогобич', 98015, '245.0375'),
('Кадіївка', 92132, '230.3300'),
('Конотоп', 92000, '230.0000');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
